Revit 2024 API
ReferenceIntersector.GetTargetElementIds Method
 Gets the set of ElementIds to test from in intersection testing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ICollection<ElementId> GetTargetElementIds()
Visual Basic
Public Function GetTargetElementIds As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ GetTargetElementIds()
Return Value
 The target ElementIds.
See Also
ReferenceIntersector Class
Autodesk.Revit.DB Namespace